"""
(...)

捕获分组，匹配括号内的任意正则表达式，并标识出该分组的开始和结尾。
组从 0 开始编号，组 0 始终存在，它表示整个正则，所以Match的对象方法都将组 0 作为默认参数；
子组从左到右编号，从 1 向上编号
分组匹配的内容可以在之后其他分组用 \number 进行再次引用

Pattern.findall(string[, pos[, endpos]])

- string：要匹配的字符串
- pos：匹配的起始位置，默认为0
- endpos：匹配的结束位置，默认为字符串长度
- 对字符串从左往右扫描，找到所有不重复匹配，以列表的形式返回，如果有子组，那么只保留子组的捕获内容，
如果子组多个（至少两个子组），则以元组形式构建列表，如果没有找到匹配的，则返回空列表
"""

import re

p = re.compile(r'\d+-\D')  # [1,+∞)个连续的数字字符，-, 匹配一个非数字字符
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == ['201-y', '3-d']

p = re.compile(r'(\d+)-\D')  # 第1个子组匹配[1,+∞)个数字字符
# 0组第1次匹配成功: r'(\d\d\d)-\D' 0组匹配到 '201-y', 1组捕获到 '201'
# 0组第2次匹配成功: r'(\d)-\D' 0组匹配到 '3-d', 1组捕获到 '3'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == ['201', '3']

p = re.compile(r'\d+-(\D)')  # 第1个子组匹配一个非数字字符
# 0组第1次匹配成功: r'\d\d\d-(\D)' 0组匹配到 '201-y', 1组捕获到 'y'
# 0组第2次匹配成功: r'\d-(\D)' 0组匹配到 '3-d', 1组捕获到 'd'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == ['y', 'd']

p = re.compile(r'(\d+)-(\D)')  # 第1个子组匹配[1,+∞)个数字字符，第2个子组匹配一个非数字字符
# 0组第1次匹配成功: r'(\d\d\d)-(\D)' 0组匹配到 '201-y', 1组捕获到 '201', 2组捕获到 'y'
# 0组第2次匹配成功: r'(\d)-(\D)' 0组匹配到 '3-d', 1组捕获到 '3', 2组捕获到 'd'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == [('201', 'y'), ('3', 'd')]

p = re.compile(r'(\d)+-(\D)')
# 0组第1次匹配成功: r'(\d)(\d)(\d)-(\D)' 0组匹配到 '201-y', 1组捕获到 '2' '0' '1', 以最后捕获到的为准，是'1', 2组捕获到 'y'
# 0组第2次匹配成功: r'(\d)-(\D)' 0组匹配到 '3-d', 1组捕获到 '3', 2组捕获到 'd'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == [('1', 'y'), ('3', 'd')]

p = re.compile(r'(\d)(\d)(\d)-(\D)')
# 0组第1次匹配成功: r'(\d)(\d)(\d)-(\D)' 0组匹配到 '201-y', 1组捕获到 '2' 2组捕获到'0' 3组捕获到'1', 4组捕获到 'y'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == [('2', '0', '1', 'y')]

p = re.compile(r'(\d){3}-(\D)')  # 对1组重复3次
# 0组第1次匹配成功: r'(\d)(\d)(\d)-(\D)' 0组匹配到 '201-y', 1组捕获到 '2' '0' '1', 以最后捕获到的为准，是'1', 2组捕获到 'y'
lst = p.findall("201-years 7098 ago, 3-dogs")
assert lst == [('1', 'y')]

p = re.compile(r'(\d)(\d){2}')  # 1组匹配1个数字字符 2组重复匹配两个数字字符
# 0组第1次匹配成功: r'(\d)(\d)(\d)' 0组匹配到 '123', 1组捕获到'1', 2组捕获到'2', '3', 以最后捕获到的为准，是'3'
# 0组第2次匹配成功: r'(\d)(\d)(\d)' 0组匹配到 '456', 1组捕获到'4', 2组捕获到'5', '6', 以最后捕获到的为准，是'6'
# 0组第3次匹配成功: r'(\d)(\d)(\d)' 0组匹配到 '789', 1组捕获到'7', 2组捕获到'8', '9', 以最后捕获到的为准，是'9'
lst = p.findall("1234567890")
assert lst == [('1', '3'), ('4', '6'), ('7', '9')]

# 捕获分组的两个作用
# 1.把括起来的内容作为一个整体
# 2.会有子组产生
p = re.compile(r'ab+')
lst = p.findall('abababb')
assert lst == ['ab', 'ab', 'abb']
p = re.compile(r'(ab)+')
# (ab)+ +取3 (ab)(ab)(ab)
# 0组匹配到 'ababab' 1组捕获到 'ab'
lst = p.findall('abababb')
assert lst == ['ab']
